# Análisis Exploratorio de los Datos

TO DO
* ANALISIS DE CABINA LLENAR ESPACIOS VACIOS CON OTRA LETRA QUE SIGNIFIUQE "OTRO"
* IMPLEMENTAR MODELOS DE CLASIFICACIÓN
* PROBAR DISTINTAS COMBINACIONES DE PARA EL ENTRENAMIENTO

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
# Carga de la base de datos
titanic = pd.read_csv("train.csv")
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
# Información de la base de datos
titanic.info()

In [ ]:
# Estadística descriptiva de las variables numéricas
titanic.describe()

## Graficas básicas

In [ ]:
titanic.groupby(by='Survived').mean()

In [ ]:
titanic.groupby(by='Survived').count()

In [ ]:
sns.countplot(data=titanic, x='Survived')
sns.set_palette('Set1')

plt.title('Survived Count')
plt.xlabel('Survived')

plt.show()

In [ ]:
sns.set_palette('Set2')
sns.catplot(x = "Survived", data = titanic, kind = "count", hue = "Sex");
plt.title('Passengers status vs gender')

In [ ]:
sns.set_palette('Set3')
sns.catplot(x = "Survived", data = titanic, kind = "count", hue = "Pclass");
plt.title('Passengers status vs Passenger class')

In [ ]:
sns.countplot(data=titanic, x='Age')
sns.set_palette('Set1')
plt.title('Age Count')
plt.xlabel('Age')
plt.show()

In [ ]:
sns.histplot(data = titanic, x = 'Age', color = 'blue')
plt.title('Age count')
plt.xlabel('Age')
plt.show()

In [ ]:
sns.histplot(data = titanic, x = 'Age', color = 'blue', hue = 'Survived', multiple="stack")
plt.title('Age count')
plt.xlabel('Age')
plt.show()

In [ ]:
sns.histplot(data = titanic, x = 'Fare', color = 'red')
plt.title('Fare count')
plt.xlabel('Fare')
plt.show()

In [ ]:
sns.histplot(data = titanic, x = 'Fare', color = 'red', hue = 'Survived', multiple="stack", bins = 20)
plt.title('Fare count')
plt.xlabel('Fare')
plt.show()

## Valores nulos

In [3]:
# Número de datos nulos por feature
titanic.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

Se observa que el número de cabina (`Cabin`) de los pasajeros cuenta con muy pocos registros, pues la mayoría son nulos. Por lo tanto, se decide eliminar dicha variable, ya que además no es una variable relevante para construir el modelo. De igual forma se eliminan las variables `PassengerId` y `Ticket` ya que es una variable que únicamente sirve para llevar un orden

### Registros duplicados

In [4]:
# No hay valores duplicados en la base de datos.
titanic.duplicated().sum()

0

### Eliminación de columna `Ticket` y `PassengerId`

In [5]:
titanic.drop(['Ticket','PassengerId'], axis=1, inplace=True)
titanic.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,NaN,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,NaN,S

In [6]:
titanic

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,NaN,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...
886,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,13.0000,NaN,S
887,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,30.0000,B42,S
888,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,23.4500,NaN,S
889,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,30.0000,C148,C
890,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,7.7500,NaN,Q

### Análisis `Age`

In [7]:
pd.DataFrame(titanic['Age'].value_counts())

       Age
24.00   30
22.00   27
18.00   26
28.00   25
19.00   25
...    ...
55.50    1
74.00    1
0.92     1
70.50    1
12.00    1

[88 rows x 1 columns]

In [8]:
titanic[titanic['Age'] == 0.92]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked
305,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,151.55,C22 C26,S

In [9]:
## Se truncan las edades al entero más bajo
titanic['Age'] = titanic['Age'].apply(np.floor)

In [10]:
titanic[titanic['Age'] == 0.92]

Empty DataFrame
Columns: [Survived, Pclass, Name, Sex, Age, SibSp, Parch, Fare, Cabin, Embarked]
Index: []

In [11]:
## Pasajeros sin edad
sin_edad = titanic.loc[titanic['Age'].isnull()]
sin_edad

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked
5,0,3,"Moran, Mr. James",male,NaN,0,0,8.4583,NaN,Q
17,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,13.0000,NaN,S
19,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,7.2250,NaN,C
26,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,7.2250,NaN,C
28,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,7.8792,NaN,Q
...,...,...,...,...,...,...,...,...,...,...
859,0,3,"Razi, Mr. Raihed",male,NaN,0,0,7.2292,NaN,C
863,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,69.5500,NaN,S
868,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,9.5000,NaN,S
878,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,7.8958,NaN,S
888,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,23.4500,NaN,S

In [ ]:
titanic[titanic['Name'] == 'Moran, Mr. James']

In [12]:
## Remplazar los valores nulos de edad por la media de dicha variable
media_age = np.floor(titanic['Age'].mean())
media_age

29.0

# De momento eliminaremos los valores nulos de la edad TO DO:

In [19]:
#titanic['Age'] = titanic['Age'].fillna(media_age)

In [20]:
#titanic.isnull().sum()

Survived    0
Pclass      0
Name        0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Cabin       0
Embarked    2
dtype: int64

In [21]:
#titanic.shape

(891, 10)

### Análisis `Cabin`

In [13]:
titanic.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,NaN,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,NaN,S

In [14]:
titanic['Cabin'] = titanic['Cabin'].fillna('Z')

In [15]:
sections = []
for i in titanic['Cabin']:
    sections.append(i[0])

In [16]:
titanic['Cabin'] = sections
titanic.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,Z,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,Z,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,C,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,Z,S

In [17]:
titanic['Cabin'].value_counts()

Z    687
C     59
B     47
D     33
E     32
A     15
F     13
G      4
T      1
Name: Cabin, dtype: int64

### Eliminación de registros con valores nulos
Finalmente eliminamos aquellos registros con valores nulos en la variable `Embarked`

In [22]:
titanic.shape

(891, 10)

In [23]:
titanic = titanic.dropna()
titanic.shape

(889, 10)

## Valores Atípicos

In [ ]:
def detectorAtipicos(variable):
    q1 = np.percentile(titanic[variable], 25)
    q3 = np.percentile(titanic[variable], 75)
    mu = titanic[variable].mean()
    sigma = titanic[variable].std()
    
    return titanic.loc[(titanic[variable] > q3 + 1.5*sigma) | (titanic[variable] < q1 - 1.5*sigma)]

In [ ]:
detectorAtipicos('Age').shape

In [ ]:
sns.set_theme(style='white')
ax = sns.boxplot(x=titanic['Age'])
plt.title('Diagrama de caja Age')
plt.grid()

In [ ]:
detectorAtipicos('Fare').shape

In [ ]:
ax = sns.boxplot(x=titanic['Fare'])
plt.title('Diagrama de caja Fare')
plt.grid()

In [ ]:
detectorAtipicos('SibSp').shape

In [ ]:
ax = sns.boxplot(x=titanic['SibSp'])
plt.title('Diagrama de caja SibSp')
plt.grid()

In [ ]:
detectorAtipicos('Parch').shape

In [ ]:
ax = sns.boxplot(x=titanic['Parch'])
plt.title('Diagrama de caja Parch')
plt.grid()

## Correlación

In [29]:
from sklearn import preprocessing
encoder = preprocessing.LabelEncoder()

# 0: female
# 1: male

# 0: C
# 1: Q
# 2: S

titanic['Sex'] = encoder.fit_transform(titanic['Sex'])
titanic['Embarked'] = encoder.fit_transform(titanic['Embarked'])
titanic['Cabin'] = encoder.fit_transform(titanic['Cabin'])
titanic.head()

<ipython-input-29-89934a834560>:11: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  titanic['Sex'] = encoder.fit_transform(titanic['Sex'])
<ipython-input-29-89934a834560>:12: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  titanic['Embarked'] = encoder.fit_transform(titanic['Embarked'])
<ipython-input-29-89934a834560>:13: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  titanic['Cabin'] = encoder.fit_transform(titanic['Cabin'])

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked
0,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,7.2500,8,2
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,71.2833,2,0
2,1,3,"Heikkinen, Miss. Laina",0,26.0,0,0,7.9250,8,2
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1,0,53.1000,2,2
4,0,3,"Allen, Mr. William Henry",1,35.0,0,0,8.0500,8,2

In [ ]:
plt.figure(figsize=(7,7))
sns.heatmap(titanic.corr(), cmap="RdYlBu", 
    annot=True, square=True,
    vmin=-1, vmax=1, fmt="+.3f")
plt.title("Correlation matrix for the train dataset")
plt.show()

# Delirios del equipo (borrar más tarde)

In [111]:
df = titanic[['Sex', 'Pclass']]
df

     Sex  Pclass
0      1       3
1      0       1
2      0       3
3      0       1
4      1       3
..   ...     ...
886    1       2
887    0       1
888    0       3
889    1       1
890    1       3

[889 rows x 2 columns]

In [112]:
df2 = pd.get_dummies(df, columns = ['Pclass'])
df2

     Sex  Pclass_1  Pclass_2  Pclass_3
0      1         0         0         1
1      0         1         0         0
2      0         0         0         1
3      0         1         0         0
4      1         0         0         1
..   ...       ...       ...       ...
886    1         0         1         0
887    0         1         0         0
888    0         0         0         1
889    1         1         0         0
890    1         0         0         1

[889 rows x 4 columns]

### Creación de set de validación para los modelos

In [31]:
from sklearn.model_selection import train_test_split
X = titanic[['Sex', 'Pclass']]
Y = titanic['Survived']

X_train, X_test, y_train, y_test = train_test_split(X, Y, test_size = 0.2, random_state=42)

In [119]:
from sklearn.model_selection import train_test_split
X = df2[['Sex','Pclass_1','Pclass_2','Pclass_3']]
Y = titanic['Survived']

X_train, X_test, y_train, y_test = train_test_split(X, Y, test_size = 0.2)

In [120]:
## Visualización de los tamaños de los conjuntos de datos
X_train.shape, X_test.shape, y_train.shape, y_test.shape

((711, 4), (178, 4), (711,), (178,))

# Implementación de Modelos de Machine Learning

## Implementación de modelo "Decision Tree Clasiffier"

### Modelo base

In [121]:
## Import dependecies
from sklearn.tree import DecisionTreeClassifier 
from sklearn.ensemble import RandomForestClassifier
from sklearn import metrics

In [122]:
## Se guarda el modelo en una variable
#clf = DecisionTreeClassifier()
rfc = RandomForestClassifier(max_depth = 10, n_estimators = 500)

## Se entrena el modelo de árbol de decisión
# clf = clf.fit(X_train,y_train)
rfc = rfc.fit(X_train, y_train)

In [123]:
y_pred = rfc.predict(X_test)

In [124]:
# Se calcula la precisión de este nuevo modelo 
print("Accuracy:",metrics.accuracy_score(y_test, y_pred))

Accuracy: 0.7696629213483146

### Entrenamiento con todos los datos

In [125]:
X_total = df2[['Sex','Pclass_1','Pclass_2','Pclass_3']]
Y_total = titanic.Survived

X_total.shape, Y_total.shape

((889, 4), (889,))

In [126]:
## Se guarda el modelo en una variable
#clf = DecisionTreeClassifier()
rfc = RandomForestClassifier(max_depth = 10, n_estimators = 500)

## Se entrena el modelo de árbol de decisión
# clf = clf.fit(X_train,y_train)
rfc = rfc.fit(X_total, Y_total)

## Carga del set de prueba

In [127]:
test = pd.read_csv('test.csv')
test

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [128]:
test['Sex'] = encoder.fit_transform(test['Sex'])
test['Embarked'] = encoder.fit_transform(test['Embarked'])
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",1,34.5,0,0,330911,7.8292,NaN,1
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",0,47.0,1,0,363272,7.0000,NaN,2
2,894,2,"Myles, Mr. Thomas Francis",1,62.0,0,0,240276,9.6875,NaN,1
3,895,3,"Wirz, Mr. Albert",1,27.0,0,0,315154,8.6625,NaN,2
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",0,22.0,1,1,3101298,12.2875,NaN,2

In [129]:
test2 = pd.get_dummies(test, columns = ['Pclass'])
test2

,PassengerId,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Pclass_1,Pclass_2,Pclass_3
0,892,"Kelly, Mr. James",1,34.5,0,0,330911,7.8292,NaN,1,0,0,1
1,893,"Wilkes, Mrs. James (Ellen Needs)",0,47.0,1,0,363272,7.0000,NaN,2,0,0,1
2,894,"Myles, Mr. Thomas Francis",1,62.0,0,0,240276,9.6875,NaN,1,0,1,0
3,895,"Wirz, Mr. Albert",1,27.0,0,0,315154,8.6625,NaN,2,0,0,1
4,896,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",0,22.0,1,1,3101298,12.2875,NaN,2,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,"Spector, Mr. Woolf",1,NaN,0,0,A.5. 3236,8.0500,NaN,2,0,0,1
414,1306,"Oliva y Ocana, Dona. Fermina",0,39.0,0,0,PC 17758,108.9000,C105,0,1,0,0
415,1307,"Saether, Mr. Simon Sivertsen",1,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,2,0,0,1
416,1308,"Ware, Mr. Frederick",1,NaN,0,0,359309,8.0500,NaN,2,0,0,1
417,1309,"Peter, Master. Michael J",1,NaN,1,1,2668,22.3583,NaN,0,0,0,1

In [ ]:
media_age = np.floor(test['Age'].mean())
test['Age'] = test['Age'].fillna(media_age)

media_fare = np.floor(test['Fare'].mean())
test['Fare'] = test['Fare'].fillna(media_fare)

In [130]:
x_test_prueba = test2[['Sex','Pclass_1','Pclass_2','Pclass_3']]

In [131]:
x_test_prueba.isnull().shape

(418, 4)

In [132]:
# Se realizan predicciones con el set de prueba
y_pred = rfc.predict(x_test_prueba)

In [133]:
ids = np.arange(892, 1310)

In [134]:
resultados = pd.DataFrame(test['PassengerId'])
resultados

     PassengerId
0            892
1            893
2            894
3            895
4            896
..           ...
413         1305
414         1306
415         1307
416         1308
417         1309

[418 rows x 1 columns]

In [135]:
resultados['Survived'] = y_pred
resultados

     PassengerId  Survived
0            892         0
1            893         0
2            894         0
3            895         0
4            896         0
..           ...       ...
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         0

[418 rows x 2 columns]

In [137]:
resultados = resultados.set_index('PassengerId')

In [ ]:
resultados

In [109]:
resultados.to_csv('Resultados3.csv')

In [138]:
resultados.value_counts()

Survived
0           338
1            80
dtype: int64